app/helpers/reports_helper.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def location?(report)
    report.location.name if report.location_id.present?

SELECT  "structures".* FROM "structures" WHERE "structures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def structure?(report)
    report.structure.name if report.structure_id.present?