app/helpers/transfers_helper.rb

SELECT  "transports".* FROM "transports" WHERE "transports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def transport?(transfer)
    transfer.transport.name if transfer.transport_id.present?