app/controllers/categories_controller.rb

  def index
    @q = Category.ransack(params[:q])
    @categories = @q.result(distinct: true).order(position: "ASC").where(user_id: current_user.id).paginate(page: params[:page], per_page: 20)
---
SELECT  DISTINCT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 ORDER BY "categories"."position" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]

  def create
    @user = current_user
    @category = @user.categories.build(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "position", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "FILCTEM"], ["position", 5], ["created_at", "2019-09-20 10:08:07.147478"], ["updated_at", "2019-09-20 10:08:07.147478"], ["user_id", 1]]