app/controllers/categories_controller.rb

  def index
    @q = Category.ransack(params[:q])
    @categories = @q.result(distinct: true).order(position: "ASC").paginate(page: params[:page], per_page: 20)
---
SELECT  DISTINCT "categories".* FROM "categories" ORDER BY "categories"."position" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]