app/controllers/locations_controller.rb

SELECT  DISTINCT "locations".* FROM "locations" WHERE "locations"."user_id" = $1 ORDER BY "locations"."position" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @q = Location.ransack(params[:q])
    @locations = @q.result(distinct: true).order(position: 'ASC').where(user_id: current_user.id).paginate(page: params[:page], per_page: 20)