app/controllers/locations_controller.rb

  def index
    @q = Location.ransack(params[:q])
    @locations = @q.result(distinct: true).order(position: "ASC").paginate(page: params[:page], per_page: 20)
---
SELECT  DISTINCT "locations".* FROM "locations" ORDER BY "locations"."position" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "locations"."id") FROM "locations"

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pordenone"], ["position", 2], ["created_at", "2019-09-11 08:53:08.144927"], ["updated_at", "2019-09-11 08:53:08.144927"]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "position" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["position", 6], ["updated_at", "2019-09-09 09:16:46.293106"], ["id", 5]]