app/controllers/offices_controller.rb

SELECT  DISTINCT "offices".* FROM "offices" WHERE "offices"."user_id" = $1 ORDER BY "offices"."position" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @q = Office.ransack(params[:q])
    @offices = @q.result(distinct: true).order(position: "ASC").where(user_id: current_user.id).paginate(page: params[:page], per_page: 20)

INSERT INTO "offices" ("name", "position", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "INCA"], ["position", 1], ["created_at", "2019-09-20 10:51:05.936547"], ["updated_at", "2019-09-20 10:51:05.936547"], ["user_id", 1]]
---
  def create
    @user = current_user
    @office = @user.offices.build(office_params)

    respond_to do |format|
      if @office.save

UPDATE "offices" SET "position" = $1, "updated_at" = $2 WHERE "offices"."id" = $3  [["position", 3], ["updated_at", "2019-09-15 09:08:13.208480"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @office.update(office_params)

SELECT  "offices".* FROM "offices" WHERE "offices"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_office
    @office = Office.find(params[:id])