app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"