app/controllers/offices_controller.rb

  def index
    @q = Office.ransack(params[:q])
    @offices = @q.result(distinct: true).order(position: "ASC").paginate(page: params[:page], per_page: 20)
---
SELECT  DISTINCT "offices".* FROM "offices" ORDER BY "offices"."position" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]