app/controllers/reports_controller.rb

SELECT  DISTINCT "reports".* FROM "reports" WHERE "reports"."user_id" = $1 ORDER BY "reports"."date" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "reports"."id") FROM "reports" WHERE "reports"."user_id" = $1  [["user_id", 1]]
---
  def index
    @q = Report.ransack(params[:q])
    @reports = @q.result(distinct: true).order(date: "DESC").where(user_id: current_user.id).paginate(page: params[:page], per_page: 6)

INSERT INTO "reports" ("name", "date", "location_id", "structure_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", 10], ["date", "2019-09-20"], ["location_id", 6], ["structure_id", 7], ["created_at", "2019-09-20 10:57:56.393918"], ["updated_at", "2019-09-20 10:57:56.393918"], ["user_id", 1]]
---
  def create
    @report = Report.new(report_params)
    @user = current_user
    @report = @user.reports.build(report_params)

    respond_to do |format|
      if @report.save

UPDATE "reports" SET "date" = $1, "updated_at" = $2 WHERE "reports"."id" = $3  [["date", "2019-12-07"], ["updated_at", "2019-09-08 16:27:22.166053"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @report.update(report_params)

DELETE FROM "reports" WHERE "reports"."id" = $1  [["id", 1]]
---
  def destroy
    @report.destroy

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def set_report
    @report = Report.find(params[:id])