app/controllers/structures_controller.rb

  def index
    @q = Structure.ransack(params[:q])
    @structures = @q.result(distinct: true).order(position: 'ASC').where(user_id: current_user.id).paginate(page: params[:page], per_page: 20)
---
SELECT  DISTINCT "structures".* FROM "structures" WHERE "structures"."user_id" = $1 ORDER BY "structures"."position" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]

  def create
    @user = current_user
    @structure = @user.structures.build(structure_params)

    respond_to do |format|
      if @structure.save
---
INSERT INTO "structures" ("name", "position", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "CCdL Gorizia CGIL"], ["position", 1], ["created_at", "2019-09-20 10:50:42.328390"], ["updated_at", "2019-09-20 10:50:42.328390"], ["user_id", 1]]

  def destroy
    @structure.destroy
---
DELETE FROM "structures" WHERE "structures"."id" = $1  [["id", 6]]

  def set_structure
    @structure = Structure.find(params[:id])
---
SELECT  "structures".* FROM "structures" WHERE "structures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]