app/controllers/structures_controller.rb

SELECT  DISTINCT "structures".* FROM "structures" ORDER BY "structures"."position" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @q = Structure.ransack(params[:q])
    @structures = @q.result(distinct: true).order(position: "ASC").paginate(page: params[:page], per_page: 20)