app/controllers/transports_controller.rb

SELECT "transports".* FROM "transports"
SELECT  DISTINCT "transports".* FROM "transports" WHERE "transports"."user_id" = $1 ORDER BY "transports"."position" ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @transports = Transport.all
    @q = Transport.ransack(params[:q])
    @transports = @q.result(distinct: true).order(position: 'ASC').where(user_id: current_user.id).paginate(page: params[:page], per_page: 20)

INSERT INTO "transports" ("name", "position", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Autovettura Aziendale"], ["position", 1], ["created_at", "2019-09-20 11:06:06.926076"], ["updated_at", "2019-09-20 11:06:06.926076"], ["user_id", 1]]
---
  def create
    @user = current_user
    @transport = @user.transports.build(transport_params)

    respond_to do |format|
      if @transport.save

UPDATE `transports` SET `position` = 4, `updated_at` = '2019-09-21 20:05:57' WHERE `transports`.`id` = 4
---
  def update
    respond_to do |format|
      if @transport.update(transport_params)

SELECT  `transports`.* FROM `transports` WHERE `transports`.`id` = 4 LIMIT 1
---
  def set_transport
    @transport = Transport.find(params[:id])