app/controllers/transfers_controller.rb

  def index
    @q = Transfer.ransack(params[:q])
    @transfers = @q.result(distinct: true).order(transfer_date: "DESC").where(user_id: current_user.id).paginate(page: params[:page], per_page: 6)
---
SELECT  DISTINCT "transfers".* FROM "transfers" WHERE "transfers"."user_id" = $1 ORDER BY "transfers"."transfer_date" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "transfers"."id") FROM "transfers" WHERE "transfers"."user_id" = $1  [["user_id", 1]]

  def show
    @transfer = Transfer.find(params[:id])
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @user = current_user
    @transfer = @user.transfers.build(transfer_params)
    respond_to do |format|
      if @transfer.save
---
INSERT INTO `transfers` (`name`, `transfer_date`, `departure`, `start_point`, `start_address`, `arrival`, `destination`, `destination_address`, `path_lenght`, `transport_id`, `note`, `created_at`, `updated_at`, `user_id`) VALUES (1, '2019-10-01', '08:00:00', 'Gorizia', 'Via del Santo, 54', '08:45:00', 'Udine', 'Via Arturo Malignani, 8', 60, 1, 'Ripresa dalle ferie.', '2019-09-21 20:07:12', '2019-09-21 20:07:12', 1)

  def update
    respond_to do |format|
      if @transfer.update(transfer_params)
---
UPDATE "transfers" SET "departure" = $1, "arrival" = $2, "note" = $3, "updated_at" = $4 WHERE "transfers"."id" = $5  [["departure", "20:00:00"], ["arrival", "20:30:00"], ["note", "Trasferimento di test..."], ["updated_at", "2019-09-20 11:34:37.056523"], ["id", 6]]

  def destroy
    @transfer.destroy
---
DELETE FROM "transfers" WHERE "transfers"."id" = $1  [["id", 4]]

  def set_transfer
    @transfer = Transfer.find(params[:id])
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]