app/controllers/transfers_controller.rb

  def create
    @user = current_user
    @transfer = @user.transfers.build(transfer_params)
    respond_to do |format|
      if @transfer.save
---
INSERT INTO "transfers" ("name", "transfer_date", "departure", "start_point", "start_address", "arrival", "destination", "destination_address", "path_lenght", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"