app/controllers/transports_controller.rb

SELECT  DISTINCT "transports".* FROM "transports" ORDER BY "transports"."position" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @transports = Transport.all
    @q = Transport.ransack(params[:q])
    @transports = @q.result(distinct: true).order(position: "ASC").paginate(page: params[:page], per_page: 20)