app/views/transfers/_form.html.erb

SELECT "transports".* FROM "transports" WHERE "transports"."user_id" = $1 ORDER BY position ASC  [["user_id", 1]]
---
  <%= f.label :transport_id, class: 'text-primary font-lite' %>
  <%= f.collection_select(:transport_id, Transport.where(user_id: current_user.id).order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>