app/views/transfers/_form.html.erb

  <%= f.label :transport_id, class: 'text-primary font-lite' %>
  <%= f.collection_select(:transport_id, Transport.order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "transports".* FROM "transports" ORDER BY position ASC