app/models/report.rb

SELECT MAX("reports"."name") FROM "reports"
---
  def set_name
    last_name = Report.maximum(:name)