app/models/transfer.rb

SELECT MAX("transfers"."name") FROM "transfers"
---
  def set_name
    last_name = Transfer.maximum(:name)