app/views/reports/_assistance_fields.html.erb

        <%= f.label :category_id, class: 'text-info font-lite' %>
        <%= f.collection_select(:category_id, Category.where(user_id: current_user.id).order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 ORDER BY position ASC  [["user_id", 1]]

        <%= f.label :office_id, class: 'text-info font-lite' %>
        <%= f.collection_select(:office_id, Office.where(user_id: current_user.id).order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "offices".* FROM "offices" WHERE "offices"."user_id" = $1 ORDER BY position ASC  [["user_id", 1]]