app/views/reports/_assistance_fields.html.erb

        <%= f.label :category_id, class: 'text-info font-lite' %>
        <%= f.collection_select(:category_id, Category.order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "categories".* FROM "categories" ORDER BY position ASC

        <%= f.label :office_id, class: 'text-info font-lite' %>
        <%= f.collection_select(:office_id, Office.order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "offices".* FROM "offices" ORDER BY position ASC