app/views/reports/_form.html.erb

SELECT "locations".* FROM "locations" ORDER BY position ASC
---
    <%= f.label :location_id, class: 'text-primary font-lite' %>
    <%= f.collection_select(:location_id, Location.order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>

SELECT "structures".* FROM "structures" ORDER BY position ASC
---
    <%= f.label :structure_id, class: 'text-primary font-lite' %>
    <%= f.collection_select(:structure_id, Structure.order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>