app/views/reports/_form.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = $1 ORDER BY position ASC  [["user_id", 1]]
---
    <%= f.label :location_id, class: 'text-primary font-lite' %>
    <%= f.collection_select(:location_id, Location.where(user_id: current_user.id).order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>

SELECT "structures".* FROM "structures" WHERE "structures"."user_id" = $1 ORDER BY position ASC  [["user_id", 1]]
---
    <%= f.label :structure_id, class: 'text-primary font-lite' %>
    <%= f.collection_select(:structure_id, Structure.where(user_id: current_user.id).order('position ASC'), :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>