app/views/reports/show.html.erb

</h4>
<% @report.assistances.each  do |assistance| %>
---
SELECT "assistances".* FROM "assistances" WHERE "assistances"."report_id" = $1  [["report_id", 6]]